--------------------------------------------------------------------------------------------------
      name:  Grant Aarons Assignment 4
       log:  C:\Users\gaarons\Git\Notes\Stata\2016F\Metrics\logs\stata_4.log
  log type:  text
 opened on:  10 Feb 2017, 18:00:35

. * Use s or t to get smcl or text log file
. /*
> Grant Aarons
> gaarons@london.edu
> Econometrics 1, London Business School
> */
. global programdir C:\Users\gaarons\Git\Notes\Stata\2016F\Metrics\programs

. global datadir C:\Users\gaarons\Git\Notes\Stata\2016F\Metrics\data

. global outputdir C:\Users\gaarons\Git\Notes\Stata\2016F\Metrics\output

. /*
> Program: stata_41.do
> Description: Introduction to econometrics in stata
> */
. 
. **********************************************************************
. ************************** START QUESTION 3 **************************
. **********************************************************************
. do $programdir/stata_41.do

. /*
> Grant Aarons
> gaarons@london.edu
> Econometrics 1, London Business School
> Assignment 4
> */
. * Load the data
. import excel "$datadir/problems.xls", sheet("problems12") firstrow clear

. * pause Dataset has been loaded
. 
. * Generate all neccessary or helpful variables
. *gen datenum = year+(quarter-1)*(0.25)
. gen t = _n

. gen newt = tq(1948q1) + t - 1

. tsset newt, quarterly
        time variable:  newt, 1948q1 to 2002q4
                delta:  1 quarter

. 
. gen cpta = (realconsumptionofnondurables +  realconsumptionofservices)/population

. gen ypta = (realdisposableincome)/population

. 
. * Prettier ways of doing this but whatever
. gen lcpta_1 = l.cpta 
(1 missing value generated)

. gen lcpta_2 = l.lcpta_1
(2 missing values generated)

. gen lcpta_3 = l.lcpta_2
(3 missing values generated)

. gen lcpta_4 = l.lcpta_3
(4 missing values generated)

. gen lcpta_5 = l.lcpta_4
(5 missing values generated)

. gen lcpta_6 = l.lcpta_5
(6 missing values generated)

. gen lypta_1 = l.ypta 
(1 missing value generated)

. 
. * first difference income per capita
. gen fd_ypta = ypta-lypta_1
(1 missing value generated)

. *cpta add lag 1
. gen cpta_al1 = cpta+lcpta_1
(1 missing value generated)

. 
. * Logical thing to do, take logs and then do all the generated variables again
. gen ln_cpta = ln(cpta)

. gen ln_ypta = ln(ypta)

. gen ln_lcpta_1 = l.ln_cpta 
(1 missing value generated)

. gen ln_lypta_1 = l.ln_ypta 
(1 missing value generated)

. * logarithm of first difference income per capita
. gen ln_fd_ypta = ln_ypta-ln_lypta_1
(1 missing value generated)

. * logarithm of cpta add lag 1
. gen ln_cpta_al1 = ln_cpta+ln_lcpta_1
(1 missing value generated)

. 
. gen instrument1 = lcpta_2 - lcpta_3
(3 missing values generated)

. gen instrument2 = lcpta_3 - lcpta_4
(4 missing values generated)

. gen instrument3 = lcpta_4 - lcpta_5
(5 missing values generated)

. gen instrument4 = lcpta_5 - lcpta_6 
(6 missing values generated)

. 
. *** Part A
. * Do the simple regression of C_t on 4 period lags of C_t and a constant
. reg cpta lcpta_1 lcpta_2 lcpta_3 lcpta_4

      Source |       SS           df       MS      Number of obs   =       216
-------------+----------------------------------   F(4, 211)       >  99999.00
       Model |  .004822372         4  .001205593   Prob > F        =    0.0000
    Residual |  1.2145e-06       211  5.7561e-09   R-squared       =    0.9997
-------------+----------------------------------   Adj R-squared   =    0.9997
       Total |  .004823586       215  .000022435   Root MSE        =    7.6e-05

------------------------------------------------------------------------------
        cpta |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lcpta_1 |   1.192335   .0673783    17.70   0.000     1.059514    1.325156
     lcpta_2 |  -.1281352   .1057009    -1.21   0.227    -.3365003      .08023
     lcpta_3 |   .1443307    .105489     1.37   0.173    -.0636167    .3522782
     lcpta_4 |  -.2074643     .06753    -3.07   0.002    -.3405841   -.0743444
       _cons |   .0000244   .0000192     1.27   0.207    -.0000136    .0000623
------------------------------------------------------------------------------

. 
. * Test the hypothesis that the beta_2 = beta_3 = beta_4 = 0
. test lcpta_2=lcpta_3=lcpta_4=0

 ( 1)  lcpta_2 - lcpta_3 = 0
 ( 2)  lcpta_2 - lcpta_4 = 0
 ( 3)  lcpta_2 = 0

       F(  3,   211) =    8.41
            Prob > F =    0.0000

. 
. *pause Part A completed
. 
. *** Part B
. * Set up the LHS variable to match the C_t + C_{t-1} in the homework write up
. * Do the simple regression of C_t + C_{t-1} on first difference per capita income
. * and a constant
. reg cpta_al1 fd_ypta

      Source |       SS           df       MS      Number of obs   =       219
-------------+----------------------------------   F(1, 217)       =      0.98
       Model |  .000089443         1  .000089443   Prob > F        =    0.3242
    Residual |  .019880734       217  .000091616   R-squared       =    0.0045
-------------+----------------------------------   Adj R-squared   =   -0.0001
       Total |  .019970178       218  .000091606   Root MSE        =    .00957

------------------------------------------------------------------------------
    cpta_al1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     fd_ypta |   3.136547   3.174417     0.99   0.324     -3.12009    9.393183
       _cons |   .0329379   .0007225    45.59   0.000     .0315138    .0343619
------------------------------------------------------------------------------

. 
. *pause Part B completed
. 
. *** Part C
. * Take logs of the relevant variables before running any regressions
. * Run 2SLS with robust White standard errors as the question requests
. * Run the first stage regression, where we try to separate the endogeneity of 
. * first difference output from residuals from regression of consumption on fd output
. reg ln_fd_ypta instrument1 instrument2 instrument3 instrument4

      Source |       SS           df       MS      Number of obs   =       214
-------------+----------------------------------   F(4, 209)       =      2.30
       Model |  .000899724         4  .000224931   Prob > F        =    0.0598
    Residual |  .020421808       209  .000097712   R-squared       =    0.0422
-------------+----------------------------------   Adj R-squared   =    0.0239
       Total |  .021321531       213  .000100101   Root MSE        =    .00988

------------------------------------------------------------------------------
  ln_fd_ypta |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 instrument1 |  -1.045102   8.959671    -0.12   0.907    -18.70801    16.61781
 instrument2 |   19.96214   8.947577     2.23   0.027     2.323066    37.60121
 instrument3 |   8.536703   9.001974     0.95   0.344    -9.209603    26.28301
 instrument4 |  -17.30184   9.018146    -1.92   0.056    -35.08003     .476346
       _cons |   .0044698   .0012121     3.69   0.000     .0020802    .0068594
------------------------------------------------------------------------------

. predict x_hat
(option xb assumed; fitted values)
(6 missing values generated)

. reg ln_cpta_al1 x_hat, robust 

Linear regression                               Number of obs     =        214
                                                F(1, 212)         =       0.89
                                                Prob > F          =     0.3456
                                                R-squared         =     0.0042
                                                Root MSE          =     .58033

------------------------------------------------------------------------------
             |               Robust
 ln_cpta_al1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       x_hat |   18.26096   19.31713     0.95   0.346    -19.81731    56.33922
       _cons |  -8.349497   .1096208   -76.17   0.000    -8.565583    -8.13341
------------------------------------------------------------------------------

. 
. * Should get the same results as the one-shot Stata command:
. ivregress 2sls ln_cpta_al1 (ln_fd_ypta=instrument1 instrument2 instrument3 instrument4), robust

Instrumental variables (2SLS) regression          Number of obs   =        214
                                                  Wald chi2(1)    =       0.73
                                                  Prob > chi2     =     0.3919
                                                  R-squared       =          .
                                                  Root MSE        =     .62881

------------------------------------------------------------------------------
             |               Robust
 ln_cpta_al1 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_fd_ypta |   18.26096   21.32902     0.86   0.392    -23.54315    60.06507
       _cons |  -8.349497   .1212462   -68.86   0.000    -8.587135   -8.111859
------------------------------------------------------------------------------
Instrumented:  ln_fd_ypta
Instruments:   instrument1 instrument2 instrument3 instrument4

. 
. *pause Part C completed
. 
end of do-file

. 
. log close _all
      name:  Grant Aarons Assignment 4
       log:  C:\Users\gaarons\Git\Notes\Stata\2016F\Metrics\logs\stata_4.log
  log type:  text
 closed on:  10 Feb 2017, 18:00:36
--------------------------------------------------------------------------------------------------
